exercises-2.1.org
#+TITLE: SICP Exercise Solutions for Section 2.1
#+AUTHOR: Paul L. Snyder
#+EMAIL: paul@pataprogramming.com
#+TODO: TODO(t) WRITEUP(w) || (d)

* 2.1.1 Example: Arithmetic Operations for Rational Numbers
** WRITEUP Exercise 2.1: Improving =make-rat=
*** Problem
     Define a better version of =make-rat= that handles both positive
     and negative arguments.  =make-rat= should normalize the sign so
     that if the rational number is positive, both the numerator and
     denominator are positive, and if the rational number is negative,
     only the numerator is negative.

*** Solution

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (gcd a b)
    (if (= b 0)
        a
        (gcd b (remainder a b))))

  (define (make-rat n d)
    (let ((nf (if (< d 0) (- n) n))
          (df (abs d))
          (g (abs (gcd n d))))
      (cons (/ nf g) (/ df g))))
#+END_SRC

* 2.1.2 Abstraction Barriers
** WRITEUP Exercise 2.2:
*** Problem
     Consider the problem of representing line segments
     in a plane.  Each segment is represented as a pair of points: a
     starting point and an ending point.  Define a constructor
     =make-segment= and selectors =start-segment= and =end-segment=
     that define the representation of segments in terms of points.
     Furthermore, a point can be represented as a pair of numbers: the
     $x$ coordinate and the $y$ coordinate.  Accordingly, specify a
     constructor =make-point= and selectors =x-point= and =y-point=
     that define this representation.  Finally, using your selectors
     and constructors, define a procedure =midpoint-segment= that takes
     a line segment as argument and returns its midpoint (the point
     whose coordinates are the average of the coordinates of the
     endpoints).  To try your procedures, you'll need a way to print
     points:

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (print-point p)
    (newline)
    (display "(")
    (display (x-point p))
    (display ",")
    (display (y-point p))
    (display ")"))
#+END_SRC

*** Solution
#+BEGIN_SRC scheme :session 2-1 :results silent
    (define (make-point x y)
      (cons x y))

    (define (x-point p)
      (car p))

    (define (y-point p)
      (cdr p))

    (define (make-segment a b)
      (cons a b))

    (define (start-segment s)
      (car s))

    (define (end-segment s)
      (cdr s))

    (define (midpoint-segment s)
      (let ((x1 (x-point (start-segment s)))
            (y1 (y-point (start-segment s)))
            (x2 (x-point (end-segment s)))
            (y2 (y-point (end-segment s))))
        (make-point (/ (+ x1 x2) 2) (/ (+ y1 y2) 2))))
#+END_SRC

** Exercise 2.3: Rectangular representations
*** Problem

     Implement a representation for rectangles in a plane.  (Hint: You
     may want to make use of Exercise 2-2.)  In terms of your
     constructors and selectors, create procedures that compute the
     perimeter and the area of a given rectangle.  Now implement a
     different representation for rectangles.  Can you design your
     system with suitable abstraction barriers, so that the same
     perimeter and area procedures will work using either
     representation?

