exercises-2.1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SICP Exercise Solutions for Section 2.1</title>
<!-- 2014-03-30 Sun 19:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul L. Snyder" />
</head>
<body>
<div id="content">
<h1 class="title">SICP Exercise Solutions for Section 2.1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 2.1.1 Example: Arithmetic Operations for Rational Numbers</a>
<ul>
<li><a href="#sec-1-1">1.1. <span class="todo WRITEUP">WRITEUP</span> Exercise 2.1: Improving <code>make-rat</code></a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Problem</a></li>
<li><a href="#sec-1-1-2">1.1.2. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 2.1.2 Abstraction Barriers</a>
<ul>
<li><a href="#sec-2-1">2.1. <span class="todo WRITEUP">WRITEUP</span> Exercise 2.2:</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Problem</a></li>
<li><a href="#sec-2-1-2">2.1.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Exercise 2.3: Rectangular representations</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Problem</a></li>
<li><a href="#sec-2-2-2">2.2.2. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 2.1.3 What Is Meant by Data?</a>
<ul>
<li><a href="#sec-3-1">3.1. Exercise 2.4: Lambdas as data structures</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Problem</a></li>
<li><a href="#sec-3-1-2">3.1.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. <span class="todo WRITEUP">WRITEUP</span> Exercise 2.5:</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Problem</a></li>
<li><a href="#sec-3-2-2">3.2.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. <span class="todo TODO">TODO</span> Exercise 2.6:</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Problem</a></li>
<li><a href="#sec-3-3-2">3.3.2. Solution</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. 2.1.4 Extended Exercise: Interval Arithmetic</a>
<ul>
<li><a href="#sec-4-1">4.1. <span class="todo WRITEUP">WRITEUP</span> Exercise 2.7: Selectors for interval arithmetic</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Problem</a></li>
<li><a href="#sec-4-1-2">4.1.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. <span class="todo WRITEUP">WRITEUP</span> Exercise 2.8: Subtracting intervals</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Problem</a></li>
<li><a href="#sec-4-2-2">4.2.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. <span class="todo TODO">TODO</span> Exercise 2.9:</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Problem</a></li>
<li><a href="#sec-4-3-2">4.3.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. <span class="todo TODO">TODO</span> Exercise 2.10:</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. Problem</a></li>
<li><a href="#sec-4-4-2">4.4.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5. <span class="todo TODO">TODO</span> Exercise 2.11: Percentage tolerances for intervals</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. Problem</a></li>
<li><a href="#sec-4-5-2">4.5.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. <span class="todo TODO">TODO</span> Exercise 2.12:</a>
<ul>
<li><a href="#sec-4-6-1">4.6.1. Problem</a></li>
<li><a href="#sec-4-6-2">4.6.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-7">4.7. <span class="todo TODO">TODO</span> Exercise 2.13:</a>
<ul>
<li><a href="#sec-4-7-1">4.7.1. Problem</a></li>
<li><a href="#sec-4-7-2">4.7.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-8">4.8. <span class="todo TODO">TODO</span> Exercise 2.14:</a>
<ul>
<li><a href="#sec-4-8-1">4.8.1. Problem</a></li>
<li><a href="#sec-4-8-2">4.8.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-9">4.9. <span class="todo TODO">TODO</span> Exercise 2.15:</a>
<ul>
<li><a href="#sec-4-9-1">4.9.1. Problem</a></li>
<li><a href="#sec-4-9-2">4.9.2. Solution</a></li>
</ul>
</li>
<li><a href="#sec-4-10">4.10. <span class="todo TODO">TODO</span> Exercise 2.16:</a>
<ul>
<li><a href="#sec-4-10-1">4.10.1. Problem</a></li>
<li><a href="#sec-4-10-2">4.10.2. Solution</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 2.1.1 Example: Arithmetic Operations for Rational Numbers</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo WRITEUP">WRITEUP</span> Exercise 2.1: Improving <code>make-rat</code></h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Define a better version of <code>make-rat</code> that handles both positive
and negative arguments.  <code>make-rat</code> should normalize the sign so
that if the rational number is positive, both the numerator and
denominator are positive, and if the rational number is negative,
only the numerator is negative.
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Solution</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-scheme">(define (gcd a b)
  (if (= b 0)
      a
      (gcd b (remainder a b))))

(define (make-rat n d)
  (let ((nf (if (&lt; d 0) (- n) n))
        (df (abs d))
        (g (abs (gcd n d))))
    (cons (/ nf g) (/ df g))))
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2.1.2 Abstraction Barriers</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo WRITEUP">WRITEUP</span> Exercise 2.2:</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Consider the problem of representing line segments
in a plane.  Each segment is represented as a pair of points: a
starting point and an ending point.  Define a constructor
<code>make-segment</code> and selectors <code>start-segment</code> and <code>end-segment</code>
that define the representation of segments in terms of points.
Furthermore, a point can be represented as a pair of numbers: the
\(x\) coordinate and the \(y\) coordinate.  Accordingly, specify a
constructor <code>make-point</code> and selectors <code>x-point</code> and <code>y-point</code>
that define this representation.  Finally, using your selectors
and constructors, define a procedure <code>midpoint-segment</code> that takes
a line segment as argument and returns its midpoint (the point
whose coordinates are the average of the coordinates of the
endpoints).  To try your procedures, you'll need a way to print
points:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (print-point p)
  (newline)
  (display "(")
  (display (x-point p))
  (display ",")
  (display (y-point p))
  (display ")"))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-scheme">(define (make-point x y)
  (cons x y))

(define (x-point p)
  (car p))

(define (y-point p)
  (cdr p))

(define (make-segment a b)
  (cons a b))

(define (start-segment s)
  (car s))

(define (end-segment s)
  (cdr s))

(define (midpoint-segment s)
  (let ((x1 (x-point (start-segment s)))
        (y1 (y-point (start-segment s)))
        (x2 (x-point (end-segment s)))
        (y2 (y-point (end-segment s))))
    (make-point (/ (+ x1 x2) 2) (/ (+ y1 y2) 2))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Exercise 2.3: Rectangular representations</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Problem</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Implement a representation for rectangles in a plane.  (Hint: You
may want to make use of Exercise 2-2.)  In terms of your
constructors and selectors, create procedures that compute the
perimeter and the area of a given rectangle.  Now implement a
different representation for rectangles.  Can you design your
system with suitable abstraction barriers, so that the same
perimeter and area procedures will work using either
representation?
</p>
</div>
</div>
