exercises-2.1.org
*** Solution

One possibility is to represent a rectangle using any two points in the
plane. For tidiness, we can normalize the internal representation
of these much as we did for exercise 2.1.

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (make-rectangle point1 point2)
    ;; normalize to top-left and bottom-right points
    (let ((x1 (min (x-point point1) (x-point point2)))
          (x2 (max (x-point point1) (x-point point2)))
          (y1 (max (y-point point1) (y-point point2)))
          (y2 (min (y-point point1) (y-point point2))))
      (cons (make-point x1 y1) (make-point x2 y2))))

  (define (top-left-rectangle r)
    (car r))

  (define (bottom-right-rectangle r)
    (cdr r))

  (define (width-rectangle r)
    (let ((x1 (x-point (top-left-rectangle r)))
          (x2 (x-point (bottom-right-rectangle r))))
      (abs (- x2 x1))))

  (define (height-rectangle r)
    (let ((y1 (y-point (top-left-rectangle r)))
          (y2 (y-point (bottom-right-rectangle r))))
      (abs (- y1 y2))))

  (define (area-rectangle r)
    (* (width-rectangle r) (height-rectangle r)))

  (define (perimeter-rectangle r)
    (* 2 (+ (width-rectangle r) (height-rectangle r))))
#+END_SRC

For another representation we could construct a representation from a
point and offsets from this point in terms of width and height.

If we were constructing a real representation (rather than just
working with an exercise in a book), we might like to do some
additional normalization for this representation as well.  In this
case, though, we'll just go with a simple constructor.

Since we haven't been introduced to robust error-checking mechanisms,
yet (such as contracts in Racket), we'll just assume that the width
and height provided are positive, and providing negative values will
result in undefined behavior.

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (make-rectangle point width height)
    (cons point (cons width height)))

  (define (bottom-right-rectangle r)
    (let ((x1 (x-point (top-left-rectangle r)))
          (y1 (y-point (top-left-rectangle r))))
      (make-point (+ x1 (car (cdr r))) (+ y1 (cdr (cdr r))))))
#+END_SRC

This isn't the most satisfying reimplementation, not least because
we're missing a most important language feature: polymorphism: there's
no way for a procedure to detect which internal representation is
being used.

We could get around this by have this alternate constructor produce an
internal representation that's the same as the first version, but
that's not the description of the problem.  For the moment, we'll just
note that none of the other procedures need to be changed for this to
work, but that based on the facilities we have available to us right
now we can't easily use rectangles that use differing internal
representations.

* 2.1.3 What Is Meant by Data?
** Exercise 2.4: Lambdas as data structures
*** Problem
     Here is an alternative procedural representation
     of pairs.  For this representation, verify that =(car (cons x y))=
     yields =x= for any objects =x= and =y=.


#+BEGIN_SRC
          (define (cons x y)
            (lambda (m) (m x y)))

          (define (car z)
            (z (lambda (p q) p)))
#+END_SRC

     What is the corresponding definition of =cdr=? (Hint: To verify
     that this works, make use of the substitution model of section
     1.1.5.)

*** Solution

First, a definition for =cdr= using this approach:

#+BEGIN_SRC :results silent
  (define (cdr z)
    (z (lambda (p q) q)))
#+END_SRC

Now, we verify these alternate versions of both =car= and =cdr=.
First, to verify =car= we follow the suggestion in the exercise and
use the substitution method.

#+BEGIN_EXAMPLE
1> (car (cons x y))
2> (car (lambda (m) (m x y))
3> ((lambda (m) (m x y)) (lambda (p q) p))
4> ((lambda (p q) p) x y)
5> ((lambda (x y) x))
6> x
#+END_EXAMPLE

Verifying the alternative version of =cdr= follows exactly the same
pattern.

#+BEGIN_EXAMPLE
1> (cdr (cons x y))
2> (cdr (lambda (m) (m x y))
3> ((lambda (m) (m x y)) (lambda (p q) q))
4> ((lambda (p q) q) x y)
5> ((lambda (x y) y))
6> y
#+END_EXAMPLE

** WRITEUP Exercise 2.5:
*** Problem
     Show that we can represent pairs of non-negative integers using
     only numbers and arithmetic operations if we represent the pair
     $a$ and $b$ as the integer that is the product $2^a 3^b$.  Give
     the corresponding definitions of the procedures =cons=, =car=,
     and =cdr=.
*** Solution

This one is fun. We can reuse the =expt= procedure for our encoding,
but need a specific answer to decode a pair: the number of times 2
occurs as a factor of the pair is the value of $a$, and the number of
time 3 occurs as a factor is the value of $b$.  Rather than implement
it separately for our =icar= and =icdr= procedures, it's best to
capture this in another descriptive procedure: =factor-count=.

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (icons a b)
    (* (expt 2 a) (expt 3 b)))

  (define (factor-count i f)
    (define (iter i c)
      (if (= (remainder i f) 0)
          (iter (/ i f) (+ c 1))
          c))
    (iter i 0))

  (define (icar p)
    (factor-count p 2))

  (define (icdr p)
    (factor-count p 3))
#+END_SRC

** TODO Exercise 2.6:
*** Problem

     In case representing pairs as procedures wasn't mind-boggling
     enough, consider that, in a language that can manipulate
     procedures, we can get by without numbers (at least insofar as
     non-negative integers are concerned) by implementing 0 and the
     operation of adding 1 as

#+BEGIN_SRC
          (define zero (lambda (f) (lambda (x) x)))

          (define (add-1 n)
            (lambda (f) (lambda (x) (f ((n f) x)))))
#+END_SRC

     This representation is known as "Church numerals", after its
     inventor, Alonzo Church, the logician who invented the $\lambda$
     calculus.

     Define =one= and =two= directly (not in terms of =zero= and
     =add-1=).  (Hint: Use substitution to evaluate =(add-1 zero)=).
     Give a direct definition of the addition procedure `+' (not in
     terms of repeated application of `add-1').
*** Solution

* 2.1.4 Extended Exercise: Interval Arithmetic
** WRITEUP Exercise 2.7: Selectors for interval arithmetic
*** Problem
     Alyssa's program is incomplete because she has not
     specified the implementation of the interval abstraction.  Here is
     a definition of the interval constructor:

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (make-interval a b) (cons a b))
#+END_SRC

     Define selectors =upper-bound= and =lower-bound= to complete the
     implementation.

