exercises-2.1.html
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Solution</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
One possibility is to represent a rectangle using any two points in the
plane. For tidiness, we can normalize the internal representation
of these much as we did for exercise 2.1.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (make-rectangle point1 point2)
  ;; normalize to top-left and bottom-right points
  (let ((x1 (min (x-point point1) (x-point point2)))
        (x2 (max (x-point point1) (x-point point2)))
        (y1 (max (y-point point1) (y-point point2)))
        (y2 (min (y-point point1) (y-point point2))))
    (cons (make-point x1 y1) (make-point x2 y2))))

(define (top-left-rectangle r)
  (car r))

(define (bottom-right-rectangle r)
  (cdr r))

(define (width-rectangle r)
  (let ((x1 (x-point (top-left-rectangle r)))
        (x2 (x-point (bottom-right-rectangle r))))
    (abs (- x2 x1))))

(define (height-rectangle r)
  (let ((y1 (y-point (top-left-rectangle r)))
        (y2 (y-point (bottom-right-rectangle r))))
    (abs (- y1 y2))))

(define (area-rectangle r)
  (* (width-rectangle r) (height-rectangle r)))

(define (perimeter-rectangle r)
  (* 2 (+ (width-rectangle r) (height-rectangle r))))
</pre>
</div>

<p>
For another representation we could construct a representation from a
point and offsets from this point in terms of width and height.
</p>

<p>
If we were constructing a real representation (rather than just
working with an exercise in a book), we might like to do some
additional normalization for this representation as well.  In this
case, though, we'll just go with a simple constructor.
</p>

<p>
Since we haven't been introduced to robust error-checking mechanisms,
yet (such as contracts in Racket), we'll just assume that the width
and height provided are positive, and providing negative values will
result in undefined behavior.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (make-rectangle point width height)
  (cons point (cons width height)))

(define (bottom-right-rectangle r)
  (let ((x1 (x-point (top-left-rectangle r)))
        (y1 (y-point (top-left-rectangle r))))
    (make-point (+ x1 (car (cdr r))) (+ y1 (cdr (cdr r))))))
</pre>
</div>

<p>
This isn't the most satisfying reimplementation, not least because
we're missing a most important language feature: polymorphism: there's
no way for a procedure to detect which internal representation is
being used.
</p>

<p>
We could get around this by have this alternate constructor produce an
internal representation that's the same as the first version, but
that's not the description of the problem.  For the moment, we'll just
note that none of the other procedures need to be changed for this to
work, but that based on the facilities we have available to us right
now we can't easily use rectangles that use differing internal
representations.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2.1.3 What Is Meant by Data?</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Exercise 2.4: Lambdas as data structures</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Here is an alternative procedural representation
of pairs.  For this representation, verify that <code>(car (cons x y))</code>
yields <code>x</code> for any objects <code>x</code> and <code>y</code>.
</p>


<pre class="example">
(define (cons x y)
  (lambda (m) (m x y)))

(define (car z)
  (z (lambda (p q) p)))
</pre>

<p>
What is the corresponding definition of <code>cdr</code>? (Hint: To verify
that this works, make use of the substitution model of section
1.1.5.)
</p>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Solution</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
First, a definition for <code>cdr</code> using this approach:
</p>

<div class="org-src-container">

<pre class="src src-:results">(define (cdr z)
  (z (lambda (p q) q)))
</pre>
</div>

<p>
Now, we verify these alternate versions of both <code>car</code> and <code>cdr</code>.
First, to verify <code>car</code> we follow the suggestion in the exercise and
use the substitution method.
</p>

<pre class="example">
1&gt; (car (cons x y))
2&gt; (car (lambda (m) (m x y))
3&gt; ((lambda (m) (m x y)) (lambda (p q) p))
4&gt; ((lambda (p q) p) x y)
5&gt; ((lambda (x y) x))
6&gt; x
</pre>

<p>
Verifying the alternative version of <code>cdr</code> follows exactly the same
pattern.
</p>

<pre class="example">
1&gt; (cdr (cons x y))
2&gt; (cdr (lambda (m) (m x y))
3&gt; ((lambda (m) (m x y)) (lambda (p q) q))
4&gt; ((lambda (p q) q) x y)
5&gt; ((lambda (x y) y))
6&gt; y
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo WRITEUP">WRITEUP</span> Exercise 2.5:</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Problem</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Show that we can represent pairs of non-negative integers using
only numbers and arithmetic operations if we represent the pair
\(a\) and \(b\) as the integer that is the product \(2^a 3^b\).  Give
the corresponding definitions of the procedures <code>cons</code>, <code>car</code>,
and <code>cdr</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Solution</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
This one is fun. We can reuse the <code>expt</code> procedure for our encoding,
but need a specific answer to decode a pair: the number of times 2
occurs as a factor of the pair is the value of \(a\), and the number of
time 3 occurs as a factor is the value of \(b\).  Rather than implement
it separately for our <code>icar</code> and <code>icdr</code> procedures, it's best to
capture this in another descriptive procedure: <code>factor-count</code>.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (icons a b)
  (* (expt 2 a) (expt 3 b)))

(define (factor-count i f)
  (define (iter i c)
    (if (= (remainder i f) 0)
        (iter (/ i f) (+ c 1))
        c))
  (iter i 0))

(define (icar p)
  (factor-count p 2))

(define (icdr p)
  (factor-count p 3))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Exercise 2.6:</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Problem</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
In case representing pairs as procedures wasn't mind-boggling
enough, consider that, in a language that can manipulate
procedures, we can get by without numbers (at least insofar as
non-negative integers are concerned) by implementing 0 and the
operation of adding 1 as
</p>

<pre class="example">
(define zero (lambda (f) (lambda (x) x)))

(define (add-1 n)
  (lambda (f) (lambda (x) (f ((n f) x)))))
</pre>

<p>
This representation is known as "Church numerals", after its
inventor, Alonzo Church, the logician who invented the \(\lambda\)
calculus.
</p>

<p>
Define <code>one</code> and <code>two</code> directly (not in terms of <code>zero</code> and
<code>add-1</code>).  (Hint: Use substitution to evaluate <code>(add-1 zero)</code>).
Give a direct definition of the addition procedure `+' (not in
terms of repeated application of `add-1').
</p>
</div>
</div>

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> Solution</h4>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 2.1.4 Extended Exercise: Interval Arithmetic</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="todo WRITEUP">WRITEUP</span> Exercise 2.7: Selectors for interval arithmetic</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Alyssa's program is incomplete because she has not
specified the implementation of the interval abstraction.  Here is
a definition of the interval constructor:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (make-interval a b) (cons a b))
</pre>
</div>

<p>
Define selectors <code>upper-bound</code> and <code>lower-bound</code> to complete the
implementation.
</p>
</div>
</div>
