exercises-2.1.org
*** Solution

First, we reproduce the definitions of Alyssa's procedures from the text:

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (add-interval x y)
    (make-interval (+ (lower-bound x) (lower-bound y))
                   (+ (upper-bound x) (upper-bound y))))

  (define (mul-interval x y)
    (let ((p1 (* (lower-bound x) (lower-bound y)))
          (p2 (* (lower-bound x) (upper-bound y)))
          (p3 (* (upper-bound x) (lower-bound y)))
          (p4 (* (upper-bound x) (upper-bound y))))
      (make-interval (min p1 p2 p3 p4)
                     (max p1 p2 p3 p4))))

  (define (div-interval x y)
    (mul-interval x
                  (make-interval (/ 1.0 (upper-bound y))
                                 (/ 1.0 (lower-bound y)))))

#+END_SRC

The definitions of =upper-bound= and =lower-bound= could not be more
straightforward.

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (upper-bound i)
    (cdr i))

  (define (lower-bound i)
    (car i))
#+END_SRC

** WRITEUP Exercise 2.8: Subtracting intervals
*** Problem
     Using reasoning analogous to Alyssa's, describe how the
     difference of two intervals may be computed.  Define a
     corresponding subtraction procedure, called =sub-interval=.
*** Solution

This one is a little bit tricky: the "analogous reasoning" that we
need to do is to figure out the smallest and largest possible results
of the operation.  For the smallest, the lowest value we can achieve
is when we subtract the highest possible value of the second interval
for the lowest possible value of the first.  Similarly, the largest
results could occur if the first interval is at its highest value and
the second interval is at its lowest.

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (sub-interval x y)
    (make-interval (- (lower-bound x) (upper-bound y))
                   (- (upper-bound x) (lower-bound y))))
#+END_SRC

** TODO Exercise 2.9:
*** Problem
     The "width" of an interval is half of the difference between its
     upper and lower bounds.  The width is a measure of the
     uncertainty of the number specified by the interval.  For some
     arithmetic operations the width of the result of combining two
     intervals is a function only of the widths of the argument
     intervals, whereas for others the width of the combination is not
     a function of the widths of the argument intervals.  Show that
     the width of the sum (or difference) of two intervals is a
     function only of the widths of the intervals being added (or
     subtracted).  Give examples to show that this is not true for
     multiplication or division.
*** Solution

** TODO Exercise 2.10:
*** Problem
     Ben Bitdiddle, an expert systems programmer, looks over Alyssa's
     shoulder and comments that it is not clear what it means to
     divide by an interval that spans zero.  Modify Alyssa's code to
     check for this condition and to signal an error if it occurs.
*** Solution

** TODO Exercise 2.11: Percentage tolerances for intervals
*** Problem
     In passing, Ben also cryptically comments: "By testing the signs
     of the endpoints of the intervals, it is possible to break
     =mul-interval= into nine cases, only one of which requires more
     than two multiplications."  Rewrite this procedure using Ben's
     suggestion.

     After debugging her program, Alyssa shows it to a potential user,
     who complains that her program solves the wrong problem.  He
     wants a program that can deal with numbers represented as a
     center value and an additive tolerance; for example, he wants to
     work with intervals such as $3.5 \pm 0.15$ rather than $\left[3.35,
     3.65\right]$.  Alyssa returns to her desk and fixes this problem by
     supplying an alternate constructor and alternate selectors:

#+BEGIN_SRC
          (define (make-center-width c w)
            (make-interval (- c w) (+ c w)))

          (define (center i)
            (/ (+ (lower-bound i) (upper-bound i)) 2))

          (define (width i)
            (/ (- (upper-bound i) (lower-bound i)) 2))
#+END_SRC

     Unfortunately, most of Alyssa's users are engineers.  Real
     engineering situations usually involve measurements with only a
     small uncertainty, measured as the ratio of the width of the
     interval to the midpoint of the interval.  Engineers usually
     specify percentage tolerances on the parameters of devices, as in
     the resistor specifications given earlier.
*** Solution

#+BEGIN_SRC scheme :session 2-1 :results silent
  (define (make-center-percent c p)
    (make-center-width c (* c */ p 100.0)))
#+END_SRC

** TODO Exercise 2.12:
*** Problem
     Define a constructor =make-center-percent= that
     takes a center and a percentage tolerance and produces the desired
     interval.  You must also define a selector =percent= that produces
     the percentage tolerance for a given interval.  The =center=
     selector is the same as the one shown above.
*** Solution

** TODO Exercise 2.13:
*** Problem
     Show that under the assumption of small percentage tolerances
     there is a simple formula for the approximate percentage
     tolerance of the product of two intervals in terms of the
     tolerances of the factors.  You may simplify the problem by
     assuming that all numbers are positive.

*** Solution

** TODO Exercise 2.14:
