exercises-2.1.html
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Solution</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
First, we reproduce the definitions of Alyssa's procedures from the text:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (add-interval x y)
  (make-interval (+ (lower-bound x) (lower-bound y))
                 (+ (upper-bound x) (upper-bound y))))

(define (mul-interval x y)
  (let ((p1 (* (lower-bound x) (lower-bound y)))
        (p2 (* (lower-bound x) (upper-bound y)))
        (p3 (* (upper-bound x) (lower-bound y)))
        (p4 (* (upper-bound x) (upper-bound y))))
    (make-interval (min p1 p2 p3 p4)
                   (max p1 p2 p3 p4))))

(define (div-interval x y)
  (mul-interval x
                (make-interval (/ 1.0 (upper-bound y))
                               (/ 1.0 (lower-bound y)))))
</pre>
</div>

<p>
The definitions of <code>upper-bound</code> and <code>lower-bound</code> could not be more
straightforward.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (upper-bound i)
  (cdr i))

(define (lower-bound i)
  (car i))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo WRITEUP">WRITEUP</span> Exercise 2.8: Subtracting intervals</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Using reasoning analogous to Alyssa's, describe how the
difference of two intervals may be computed.  Define a
corresponding subtraction procedure, called <code>sub-interval</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Solution</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
This one is a little bit tricky: the "analogous reasoning" that we
need to do is to figure out the smallest and largest possible results
of the operation.  For the smallest, the lowest value we can achieve
is when we subtract the highest possible value of the second interval
for the lowest possible value of the first.  Similarly, the largest
results could occur if the first interval is at its highest value and
the second interval is at its lowest.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (sub-interval x y)
  (make-interval (- (lower-bound x) (upper-bound y))
                 (- (upper-bound x) (lower-bound y))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Exercise 2.9:</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
The "width" of an interval is half of the difference between its
upper and lower bounds.  The width is a measure of the
uncertainty of the number specified by the interval.  For some
arithmetic operations the width of the result of combining two
intervals is a function only of the widths of the argument
intervals, whereas for others the width of the combination is not
a function of the widths of the argument intervals.  Show that
the width of the sum (or difference) of two intervals is a
function only of the widths of the intervals being added (or
subtracted).  Give examples to show that this is not true for
multiplication or division.
</p>
</div>
</div>

<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Exercise 2.10:</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Ben Bitdiddle, an expert systems programmer, looks over Alyssa's
shoulder and comments that it is not clear what it means to
divide by an interval that spans zero.  Modify Alyssa's code to
check for this condition and to signal an error if it occurs.
</p>
</div>
</div>

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> Exercise 2.11: Percentage tolerances for intervals</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
In passing, Ben also cryptically comments: "By testing the signs
of the endpoints of the intervals, it is possible to break
<code>mul-interval</code> into nine cases, only one of which requires more
than two multiplications."  Rewrite this procedure using Ben's
suggestion.
</p>
</div>
</div>
<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> <span class="todo TODO">TODO</span> Exercise 2.12:</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Define a constructor <code>make-center-percent</code> that
takes a center and a percentage tolerance and produces the desired
interval.  You must also define a selector <code>percent</code> that produces
the percentage tolerance for a given interval.  The <code>center</code>
selector is the same as the one shown above.
</p>
</div>
</div>

<div id="outline-container-sec-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> Solution</h4>
<div class="outline-text-4" id="text-4-6-2">
<pre class="example">
(define (make-center-width c w)
  (make-interval (- c w) (+ c w)))

(define (center i)
  (/ (+ (lower-bound i) (upper-bound i)) 2))

(define (width i)
  (/ (- (upper-bound i) (lower-bound i)) 2))
</pre>

<div class="org-src-container">

<pre class="src src-scheme">(define (make-center-percent c p)
  (make-center-width c (* c */ p 100.0)))

(define (percent i)
  (* 100.0 (/ width i) (center i)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> <span class="todo TODO">TODO</span> Exercise 2.13:</h3>
<div class="outline-text-3" id="text-4-7">
</div><div id="outline-container-sec-4-7-1" class="outline-4">
<h4 id="sec-4-7-1"><span class="section-number-4">4.7.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
Show that under the assumption of small percentage tolerances
there is a simple formula for the approximate percentage
tolerance of the product of two intervals in terms of the
tolerances of the factors.  You may simplify the problem by
assuming that all numbers are positive.
</p>
</div>
</div>
<div id="outline-container-sec-4-7-2" class="outline-4">
<h4 id="sec-4-7-2"><span class="section-number-4">4.7.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> <span class="todo TODO">TODO</span> Exercise 2.14:</h3>
