exercises-2.1.org
*** Problem
     After considerable work, Alyssa P. Hacker delivers her finished
     system.  Several years later, after she has forgotten all about
     it, she gets a frenzied call from an irate user, Lem E. Tweakit.
     It seems that Lem has noticed that the formula for parallel
     resistors can be written in two algebraically equivalent ways:
     \[\frac{r_1 r_2}{r_1 + r_2}\]
     and
     \[\frac{1}{1/r_1 + 1/r_2}\]

     He has written the following two programs, each of which computes
     the parallel-resistors formula differently:

#+BEGIN_SRC
          (define (par1 r1 r2)
            (div-interval (mul-interval r1 r2)
                          (add-interval r1 r2)))

          (define (par2 r1 r2)
            (let ((one (make-interval 1 1)))
              (div-interval one
                            (add-interval (div-interval one r1)
                                          (div-interval one r2)))))
#+END_SRC


     Lem complains that Alyssa's program gives different answers for
     the two ways of computing. This is a serious complaint.

     Demonstrate that Lem is right.  Investigate the
     behavior of the system on a variety of arithmetic expressions.
     Make some intervals $A$ and $B$, and use them in computing the
     expressions $A/A$ and $A/B$.  You will get the most insight by using
     intervals whose width is a small percentage of the center value.
     Examine the results of the computation in center-percent form (see
     Exercise 2.12).
*** Solution

** TODO Exercise 2.15:
*** Problem
     Eva Lu Ator, another user, has also noticed the different
     intervals computed by different but algebraically equivalent
     expressions. She says that a formula to compute with intervals
     using Alyssa's system will produce tighter error bounds if it can
     be written in such a form that no variable that represents an
     uncertain number is repeated.  Thus, she says, =par2= is a
     "better" program for parallel resistances than =par1=.  Is she
     right?  Why?
*** Solution

** TODO Exercise 2.16:
*** Problem
     Explain, in general, why equivalent algebraic expressions may
     lead to different answers.  Can you devise an interval-arithmetic
     package that does not have this shortcoming, or is this task
     impossible?  (Warning: This problem is very difficult.)
*** Solution
