exercises-2.1.html
<div class="outline-text-3" id="text-4-8">
</div><div id="outline-container-sec-4-8-1" class="outline-4">
<h4 id="sec-4-8-1"><span class="section-number-4">4.8.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-8-1">
<p>
After considerable work, Alyssa P. Hacker delivers her finished
system.  Several years later, after she has forgotten all about
it, she gets a frenzied call from an irate user, Lem E. Tweakit.
It seems that Lem has noticed that the formula for parallel
resistors can be written in two algebraically equivalent ways:
\[\frac{r_1 r_2}{r_1 + r_2}\]
and
\[\frac{1}{1/r_1 + 1/r_2}\]
</p>

<p>
He has written the following two programs, each of which computes
the parallel-resistors formula differently:
</p>

<pre class="example">
(define (par1 r1 r2)
  (div-interval (mul-interval r1 r2)
                (add-interval r1 r2)))

(define (par2 r1 r2)
  (let ((one (make-interval 1 1)))
    (div-interval one
                  (add-interval (div-interval one r1)
                                (div-interval one r2)))))
</pre>


<p>
Lem complains that Alyssa's program gives different answers for
the two ways of computing. This is a serious complaint.
</p>

<p>
Demonstrate that Lem is right.  Investigate the
behavior of the system on a variety of arithmetic expressions.
Make some intervals \(A\) and \(B\), and use them in computing the
expressions \(A/A\) and \(A/B\).  You will get the most insight by using
intervals whose width is a small percentage of the center value.
Examine the results of the computation in center-percent form (see
Exercise 2.12).
</p>
</div>
</div>

<div id="outline-container-sec-4-8-2" class="outline-4">
<h4 id="sec-4-8-2"><span class="section-number-4">4.8.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> <span class="todo TODO">TODO</span> Exercise 2.15:</h3>
<div class="outline-text-3" id="text-4-9">
</div><div id="outline-container-sec-4-9-1" class="outline-4">
<h4 id="sec-4-9-1"><span class="section-number-4">4.9.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-9-1">
<p>
Eva Lu Ator, another user, has also noticed the different
intervals computed by different but algebraically equivalent
expressions. She says that a formula to compute with intervals
using Alyssa's system will produce tighter error bounds if it can
be written in such a form that no variable that represents an
uncertain number is repeated.  Thus, she says, <code>par2</code> is a
"better" program for parallel resistances than <code>par1</code>.  Is she
right?  Why?
</p>
</div>
</div>

<div id="outline-container-sec-4-9-2" class="outline-4">
<h4 id="sec-4-9-2"><span class="section-number-4">4.9.2</span> Solution</h4>
</div>
</div>
<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> <span class="todo TODO">TODO</span> Exercise 2.16:</h3>
<div class="outline-text-3" id="text-4-10">
</div><div id="outline-container-sec-4-10-1" class="outline-4">
<h4 id="sec-4-10-1"><span class="section-number-4">4.10.1</span> Problem</h4>
<div class="outline-text-4" id="text-4-10-1">
<p>
Explain, in general, why equivalent algebraic expressions may
lead to different answers.  Can you devise an interval-arithmetic
package that does not have this shortcoming, or is this task
impossible?  (Warning: This problem is very difficult.)
</p>
</div>
</div>

<div id="outline-container-sec-4-10-2" class="outline-4">
<h4 id="sec-4-10-2"><span class="section-number-4">4.10.2</span> Solution</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul L. Snyder</p>
<p class="date">Created: 2014-03-30 Sun 19:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
